---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal
source: html/26c3351b-e09f-0140-ebaf-67bae78759a5.htm
---
# VertexPositionNormal Members

Constructs the vertex from a point and a normal vector.